In [1]:
import pandas as pd

In [20]:
df = pd.read_csv('question4_data.csv')

In [21]:
# Get all the Earth meteorites that fell before the year 2000
df[df['Year at which Earth Meteorite was hit'] < '2000']

,Name of Earth Meteorite,ID of Earth Meteorite,nametype,recclass,Mass of Earth Meteorite,Year at which Earth Meteorite was hit,reclat,recclong
0,Aachen,1,Valid,L5,21.0,1880-01-01T00:00:00.000,50.77500,6.08333
1,Aarhus,2,Valid,H6,720.0,1951-01-01T00:00:00.000,56.18333,10.23333
2,Abee,6,Valid,EH4,107000.0,1952-01-01T00:00:00.000,54.21667,-113.00000
3,Acapulco,10,Valid,Acapulcoite,1914.0,1976-01-01T00:00:00.000,16.88333,-99.90000
4,Achiras,370,Valid,L6,780.0,1902-01-01T00:00:00.000,-33.16667,-64.95000
...,...,...,...,...,...,...,...,...
994,Timochin,24004,Valid,H5,65500.0,1807-01-01T00:00:00.000,54.50000,35.20000
995,Tirupati,24009,Valid,H6,230.0,1934-01-01T00:00:00.000,13.63333,79.41667
997,Tjabe,24011,Valid,H6,20000.0,1869-01-01T00:00:00.000,-7.08333,111.53333
998,Tjerebon,24012,Valid,L5,16500.0,1922-01-01T00:00:00.000,-6.66667,106.58333
999,Tomakovka,24019,Valid,LL6,600.0,1905-01-01T00:00:00.000,47.85000,34.76667

In [24]:
#  Get all the earth meteorites co-ordinates who fell before the year 1970
year_1970 = df[df['Year at which Earth Meteorite was hit']< '1970']

In [27]:
year_1970[['Name of Earth Meteorite','Year at which Earth Meteorite was hit']]

    Name of Earth Meteorite Year at which Earth Meteorite was hit
0                    Aachen               1880-01-01T00:00:00.000
1                    Aarhus               1951-01-01T00:00:00.000
2                      Abee               1952-01-01T00:00:00.000
4                   Achiras               1902-01-01T00:00:00.000
5                  Adhi Kot               1919-01-01T00:00:00.000
..                      ...                                   ...
994                Timochin               1807-01-01T00:00:00.000
995                Tirupati               1934-01-01T00:00:00.000
997                   Tjabe               1869-01-01T00:00:00.000
998                Tjerebon               1922-01-01T00:00:00.000
999               Tomakovka               1905-01-01T00:00:00.000

[780 rows x 2 columns]

In [30]:
# ● Assuming that the mass of the earth meteorites was in kg, get all those whose mass was more than 10000kg
df[df['Mass of Earth Meteorite'] > 10000]

,Name of Earth Meteorite,ID of Earth Meteorite,nametype,recclass,Mass of Earth Meteorite,Year at which Earth Meteorite was hit,reclat,recclong
2,Abee,6,Valid,EH4,107000.0,1952-01-01T00:00:00.000,54.21667,-113.00000
7,Agen,392,Valid,H5,30000.0,1814-01-01T00:00:00.000,44.21667,0.61667
11,Aïr,424,Valid,L6,24000.0,1925-01-01T00:00:00.000,19.08333,8.38333
16,Akyumak,433,Valid,"Iron, IVA",50000.0,1981-01-01T00:00:00.000,39.91667,42.81667
27,Alfianello,466,Valid,L6,228000.0,1883-01-01T00:00:00.000,45.26667,10.15000
...,...,...,...,...,...,...,...,...
991,Tieschitz,23989,Valid,H/L3.6,28000.0,1878-01-01T00:00:00.000,49.60000,17.11667
992,Tilden,23998,Valid,L6,74800.0,1927-01-01T00:00:00.000,38.20000,-89.68333
994,Timochin,24004,Valid,H5,65500.0,1807-01-01T00:00:00.000,54.50000,35.20000
997,Tjabe,24011,Valid,H6,20000.0,1869-01-01T00:00:00.000,-7.08333,111.53333
998,Tjerebon,24012,Valid,L5,16500.0,1922-01-01T00:00:00.000,-6.66667,106.58333